var APP_DATA = {
  "scenes": [
    {
      "id": "0-",
      "name": "Ресепшен",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": 3.125824764912931,
        "pitch": 0,
        "fov": 1.5651056597642057
      },
      "linkHotspots": [
        {
          "yaw": 1.5284255441532908,
          "pitch": 0.547767425689301,
          "rotation": 6.283185307179586,
          "target": "9-"
        },
        {
          "yaw": -2.9749586341527703,
          "pitch": 0.4621235306372036,
          "rotation": 0,
          "target": "10---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.717648541925578,
          "pitch": 0.3259782956679089,
          "title": "Савита",
          "text": "<div>Добро по жаловать в Савита:</div>| С - спортивная<div><div>| А - активная</div><div>| ВИТА - жизнь</div></div>"
        }
      ]
    },
    {
      "id": "1--",
      "name": "Зал Милон",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": 1.6061431995958078,
        "pitch": 0.025243639673618645,
        "fov": 1.4918548395255922
      },
      "linkHotspots": [
        {
          "yaw": 1.5670575545476666,
          "pitch": 0.44241745729431514,
          "rotation": 0.7853981633974483,
          "target": "2--"
        },
        {
          "yaw": 0.4495294185935599,
          "pitch": 0.24327753968372967,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -1.4277425053051829,
          "pitch": 0.02888068975182634,
          "rotation": 0.7853981633974483,
          "target": "6--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.0061212891214577,
          "pitch": 0.053356997651750504,
          "title": "Зал Милон",
          "text": "Зал с интеллектуальными тренажёрами Milon для круговой тренировки вех мышечных групп тела, где оборудование автоматически настраивается под параметры и программу занимающегося."
        },
        {
          "yaw": -2.3617288995078525,
          "pitch": -0.051797241499865976,
          "title": "Разгибание голеней",
          "text": "Целевые мышцы:<div>- Четырехглавые мышцы бедер</div>"
        },
        {
          "yaw": -1.8829845425266818,
          "pitch": -0.045756981784926154,
          "title": "Сгибание голеней",
          "text": "Целевые мышцы:<br>- Двуглавые мышцы бедер"
        },
        {
          "yaw": -0.6667752353957503,
          "pitch": 0.029670907123676926,
          "title": "Отведение бедер",
          "text": "Целевые мышцы:<div>- Средние ягодичные мышцы</div>"
        },
        {
          "yaw": -0.16348362794921556,
          "pitch": 0.013996790611908949,
          "title": "Приведение бедер",
          "text": "Целевые мышцы:<br><div>- Большие приводящие мышцы</div><div>- Длинные приводящие мышцы</div><div>- Короткие приводящие мышцы</div><div>- Гребенчатые мышцы</div><div>- Тонкие мышцы бедер</div>"
        },
        {
          "yaw": 0.07613873982529995,
          "pitch": -0.0006009025632209841,
          "title": "Приведение рук",
          "text": "Целевые мышцы:<div>- Большие грудные мышцы, средние головки</div>"
        }
      ]
    },
    {
      "id": "2--",
      "name": "Зал Милон",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": -0.952262441842775,
        "pitch": -0.0043669377097455,
        "fov": 1.3537506900225833
      },
      "linkHotspots": [
        {
          "yaw": 0.07525372163858002,
          "pitch": 0.45163143504132286,
          "rotation": 0.7853981633974483,
          "target": "1--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.645870508226004,
          "pitch": -0.058841703727427586,
          "title": "Горизонтальная тяга",
          "text": "Целевые мышцы:&nbsp;<div>- Широчайшие мышцы спины</div><div>- Ромбовидные мышцы</div>"
        },
        {
          "yaw": -1.2764229602643535,
          "pitch": -0.06502572867298895,
          "title": "Жим платформы ногами",
          "text": "Разгибание ног лежа под углом 45 градусов в тренажере<br><br>Целевые мышцы:<br>- Четырехглавые мышцы бедер<div>- Большие ягодичные</div>"
        },
        {
          "yaw": -2.338089577700867,
          "pitch": -0.05195167604270701,
          "title": "Велосипед",
          "text": "Педалирование на велоэргометре<div><br></div><div>Целевые мышцы:</div><div>- Четырехглавые мышцы бедер</div><div>- Большие ягодичные мышцы</div><div>- Двуглавые мышцы бедер</div><div>- Икроножные мышцы</div>"
        },
        {
          "yaw": -0.8267934608793759,
          "pitch": -0.0531369367097394,
          "title": "Отжимания на брусьях",
          "text": "Разгибание рук в упоре на ручках тренажера<div><br></div><div>Целевые мышцы:</div><div>- Передние пучки дельтовидных мышц</div><div>- Большие грудные, реберные головки</div><div>- Трехглавые мышцы плеч</div>"
        },
        {
          "yaw": -0.3910400554429234,
          "pitch": -0.03451714411995788,
          "title": "Элипсоиды",
          "text": "Text"
        },
        {
          "yaw": -2.787344488802969,
          "pitch": -0.03749247236572373,
          "title": "Отведение рук",
          "text": "Целевые мышцы:<div>- Задние пучки дельтовидных мышц</div>"
        },
        {
          "yaw": 3.006478704682129,
          "pitch": -0.13506194851972708,
          "title": "Вертикальная тяга",
          "text": "Целевые мышцы:<div>- Широчайшие мышцы спины</div>"
        },
        {
          "yaw": 2.6820214653390497,
          "pitch": -0.1320222004337417,
          "title": "Жим вверх сидя",
          "text": "Целевые мышцы:<div>- Средние пучки дельтовидных мышц</div>"
        },
        {
          "yaw": 2.2864326711649703,
          "pitch": 0.050521260741199114,
          "title": "Разгибание спины",
          "text": "Целевые мышцы<div>- Мышцы разгибающие позвоночник</div>"
        },
        {
          "yaw": 1.867594110455947,
          "pitch": 0.046827564370669705,
          "title": "Сгибание туловища",
          "text": "Целевые мышцы:<div>- Прямая мышца живота</div>"
        },
        {
          "yaw": 1.5663870776482813,
          "pitch": 0.019552192937290158,
          "title": "Жим от груди сидя",
          "text": "Целевые мышцы:<div>- Большие грудные мышцы, средние пучки</div>"
        },
        {
          "yaw": -0.13339209615618408,
          "pitch": -0.011989955470676605,
          "title": "Сгибание предплечий",
          "text": "Целевые мышцы:<div>- Двуглавые мышцы плеч</div><div>- Плечевые мышцы</div>"
        }
      ]
    },
    {
      "id": "3--2",
      "name": "Зал 2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        },
        {
          "tileSize": 512,
          "size": 4096
        }
      ],
      "faceSize": 3750,
      "initialViewParameters": {
        "yaw": 2.7151884821577665,
        "pitch": 0,
        "fov": 1.5651056597642057
      },
      "linkHotspots": [
        {
          "yaw": 2.8111160794267187,
          "pitch": 0.36865870411368107,
          "rotation": 0.7853981633974483,
          "target": "4--2"
        },
        {
          "yaw": -1.0006567447309642,
          "pitch": 0.5619088805706518,
          "rotation": 0,
          "target": "10---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.23597168409421,
          "pitch": 0.21030778279434514,
          "title": "Умный тренажер",
          "text": "Разработка НПЦ ФР Савита, тренажер превосходящий по функциям ведущие мировые бренды с возможностью реализовать различную нагрузку в фазах движения."
        },
        {
          "yaw": -2.6985067308072583,
          "pitch": 0.1946432414218009,
          "title": "Подвесные системы",
          "text": "- Гамак для аэройоги<div>- Система функциональных тренировок с использованием петель TRX</div>"
        },
        {
          "yaw": 3.0854002314582134,
          "pitch": 0.19772514897103832,
          "title": "Силовая рама",
          "text": "Настраивается под:<br>- Жимы лежа горизонтально и под наклонами<br>- Приседы<br>- Тяги"
        }
      ]
    },
    {
      "id": "4--2",
      "name": "Зал 2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.7731471226011273,
          "pitch": 0.35768321789410784,
          "rotation": 11.780972450961727,
          "target": "3--2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.6107866338714576,
          "pitch": 0.01260863741907059,
          "title": "Экзарта",
          "text": "Методика диагностики:<div>- Здоровых людей, для улучшения качества жизни<br>- Точечного развития профессиональных спортсменов для улучшения результатов</div><div>- Реабилитации бытовых функций после травм и операций</div><div><br></div><div>Позволяет выявить, а также устранить мышечный дисбаланс и восстановить двигательные навыки.</div>"
        },
        {
          "yaw": 0.37466226928949276,
          "pitch": -0.0317167392085107,
          "title": "Инверсивный стол",
          "text": "Тренажер, позволяющий безопасно перевернуть человека вниз головой.<br><div><br></div><div>Позволяет:</div><div>- Снизить компрессию позвонков</div><div>- Улучшить кровообращение</div><div>- Расслабить мышцы</div>"
        },
        {
          "yaw": 1.871862682113301,
          "pitch": 0.04119202574731062,
          "title": "Concept",
          "text": "Тренажеры, имитирующие греблю на байдарке"
        },
        {
          "yaw": -3.101905029242552,
          "pitch": 0.04341509870585192,
          "title": "Kinesis Personal",
          "text": "Позволяет двигаться свободно в трёх плоскостях, активируя при этом все мышечные цепи тела."
        }
      ]
    },
    {
      "id": "5--",
      "name": "Кабинет Массажа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1500,
      "initialViewParameters": {
        "yaw": -2.629973334220722,
        "pitch": 0,
        "fov": 1.5651056597642057
      },
      "linkHotspots": [
        {
          "yaw": 0.18686829152630047,
          "pitch": 0.3034916900405875,
          "rotation": 12.566370614359176,
          "target": "9-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -3.1288678598882527,
          "pitch": 0.20878252569908895,
          "title": "Прессотерапия",
          "text": "Аппаратный лимфодренажный массаж, при котором на тело человека воздействуют сжатым воздухом с помощью специального костюма."
        },
        {
          "yaw": -2.679117181035755,
          "pitch": 0.09281678908878987,
          "title": "<ya-tr-span data-index=\"66-0\" data-translated=\"true\" data-source-lang=\"en\" data-target-lang=\"ru\" data-value=\"Title\" data-translation=\"Название\" data-ch=\"0\" data-type=\"trSpan\" style=\"visibility: inherit !important;\">R-Sleek</ya-tr-span>",
          "text": "<ya-tr-span data-index=\"68-0\" data-translated=\"true\" data-source-lang=\"en\" data-target-lang=\"ru\" data-value=\"Аппа\" data-translation=\"Аппа\" data-ch=\"0\" data-type=\"trSpan\" style=\"visibility: inherit !important;\">Аппарат премиум-класса для комплексного омоложения и коррекции фигуры, который сочетает лифтинг с эффективностью вакуумно-массажного воздействия. Он дает выраженный результат, но требует курсового применения и профессионального исполнения.</ya-tr-span>"
        },
        {
          "yaw": -1.8015218688312267,
          "pitch": 0.4044438585334351,
          "title": "Биоимпедансометрия",
          "text": "Быстрый, безболезненный и точный анализ состава тела (процент жира, мышц, жидкости и обмена веществ), что позволяет объективно оценить физическую форму, подобрать план питания и контролировать эффективность тренировок, выходя за рамки обычных весов."
        }
      ]
    },
    {
      "id": "6--",
      "name": "Кабинет диагностики",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": 3.004631241381759,
        "pitch": 0.002413318462107128,
        "fov": 1.5651056597642057
      },
      "linkHotspots": [
        {
          "yaw": 0.31795478614134964,
          "pitch": 0.21316694367772016,
          "rotation": 5.497787143782138,
          "target": "1--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 3.0155842552517598,
          "pitch": 0.23000285077302252,
          "title": "Stima Well",
          "text": "Профессиональный массажный тренажер, который работает по технологии EMS (электростимулятор для мышц) без механического воздействия и побочных эффектов.<br>Более 140 программ для профилактики, лечения или развития мышц спины и осанки."
        },
        {
          "yaw": -2.382936608080975,
          "pitch": -0.05898898385946438,
          "title": "УЗИ",
          "text": "Метод диагностики организма, который основан на отражении высокочастотных волн от тканей и стенок внутренних органов. С его помощью можно узнать об их расположении, форме, размере, структуре."
        }
      ]
    },
    {
      "id": "7-",
      "name": "Раздевалки",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": 3.0360994335902936,
        "pitch": 0,
        "fov": 1.5651056597642057
      },
      "linkHotspots": [
        {
          "yaw": -0.0768346827251083,
          "pitch": 0.22430070318061013,
          "rotation": 0,
          "target": "10---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -3.1292472278207555,
          "pitch": 0.05035416898381051,
          "title": "Раздевалки",
          "text": "\n\n\n\n\n\n\n<p class=\"p1\"><span class=\"s1\">Мужская и женская раздевалки рассчитаны на одновременное использование до 10 человек каждая, оснащены индивидуальными шкафчиками, 12 стульями для переодевания, душевой зоной и санузлом, обеспечивая комфортные условия для подготовки к тренировке и отдыха после неё.</span></p>"
        }
      ]
    },
    {
      "id": "8-",
      "name": "Туалет",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": 3.0336695302375407,
        "pitch": -0.0014773853697640504,
        "fov": 1.5651056597642057
      },
      "linkHotspots": [
        {
          "yaw": 0.9296558131389361,
          "pitch": 0.3965425932076556,
          "rotation": 0,
          "target": "9-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.485015813167559,
          "pitch": 0.2683292722900763,
          "title": "Адаптируемый для ОВЗ",
          "text": "Просторное доступное помещение с возможностью установки поручней"
        }
      ]
    },
    {
      "id": "9-",
      "name": "Коридор",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": -0.5345619880422561,
        "pitch": 0,
        "fov": 1.5651056597642057
      },
      "linkHotspots": [
        {
          "yaw": 0.054838207846076514,
          "pitch": 0.2936452251919661,
          "rotation": 0,
          "target": "5--"
        },
        {
          "yaw": -1.051247311736585,
          "pitch": 0.6515594316568123,
          "rotation": 5.497787143782138,
          "target": "8-"
        },
        {
          "yaw": -3.016098582003849,
          "pitch": 0.5991397254832975,
          "rotation": 0,
          "target": "0-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "10---",
      "name": "Раздевалки и залы",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": -0.651086635793213,
        "pitch": 0,
        "fov": 1.5651056597642057
      },
      "linkHotspots": [
        {
          "yaw": -2.9634035718090352,
          "pitch": 0.4673624546071782,
          "rotation": 6.283185307179586,
          "target": "0-"
        },
        {
          "yaw": -0.057907390015156324,
          "pitch": 0.17506647103511597,
          "rotation": 12.566370614359176,
          "target": "7-"
        },
        {
          "yaw": 1.4785812807533523,
          "pitch": 0.25414188869724796,
          "rotation": 0,
          "target": "1--"
        },
        {
          "yaw": -1.5364699523790595,
          "pitch": 0.3274398972706294,
          "rotation": 0,
          "target": "3--2"
        }
      ],
      "infoHotspots": []
    }
  ],
  "name": "Савита, НГУ им. П.Ф. Лесгафта",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": true,
    "fullscreenButton": true,
    "viewControlButtons": false
  }
};
